# ============================================================
#  НАСТРОЙКИ
# ============================================================

# Время удержания клавиши (сек)
HOLD_TIME = 1.5

# Время между циклами (сек)
CYCLE_DELAY = 0.001

# Задержка после нажатия (сек)
COOLDOWN_AFTER_PRESS = 0.15

# % Совпадения шаблона для обычных клавиш
MATCH_THRESHOLD = 0.45

# % Совпадения шаблона для модификаторов
MODIFIER_THRESHOLD = 0.35

# ==== НЕ ТРОГАЙТЕ ЕСЛИ НЕ УВЕРЕНЫ =====
X1_RATIO = 0.4427
Y1_RATIO = 0.6944
X2_RATIO = 0.5547
Y2_RATIO = 0.8102

# Сопоставление имен шаблонов с клавишами
KEY_MAP = {
    'A': 'a', 'C': 'c', 'D': 'd', 'E': 'e',
    'J': 'j', 'K': 'k', 'L': 'l', 'N': 'n',
    'Q': 'q', 'R': 'r', 'S': 's', 'W': 'w',
    'L_ALT': 'alt', 
    'L_SHIFT': 'shift', 
    'L_CTRL': 'ctrl'
}

# Шаблоны для распознавания
TEMPLATE_KEYS = ['L_ALT', 'L_SHIFT', 'L_CTRL', 'A', 'C', 'D', 'E', 'J', 
                 'K', 'L', 'N', 'Q', 'R', 'S', 'W']
